#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_compute_global_address.jade-initials-ip["sh"] will be created
  + resource "google_compute_global_address" "jade-initials-ip" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "jade-dev-sh"
      + project            = (known after apply)
      + self_link          = (known after apply)
    }

  # google_sql_database.jade-datarepo-initials-db["sh"] will be created
  + resource "google_sql_database" "jade-datarepo-initials-db" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = "jade-postgres-101-987f0c3b501aeabf"
      + name      = "datarepo-sh"
      + project   = "broad-jade-dev"
      + self_link = (known after apply)
    }

  # google_sql_database.jade-stairway-initials-db["sh"] will be created
  + resource "google_sql_database" "jade-stairway-initials-db" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = "jade-postgres-101-987f0c3b501aeabf"
      + name      = "stairway-sh"
      + project   = "broad-jade-dev"
      + self_link = (known after apply)
    }

  # module.initials-dns-set.google_dns_record_set.set_dns_record["jade-global-sh"] will be created
  + resource "google_dns_record_set" "set_dns_record" {
      + id           = (known after apply)
      + managed_zone = "datarepo-dev"
      + name         = "jade-global-sh.datarepo-dev.broadinstitute.org."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

  # module.initials-dns-set.google_dns_record_set.set_dns_record["jade-sh"] will be created
  + resource "google_dns_record_set" "set_dns_record" {
      + id           = (known after apply)
      + managed_zone = "datarepo-dev"
      + name         = "jade-sh.datarepo-dev.broadinstitute.org."
      + project      = (known after apply)
      + rrdatas      = [
          + "jade-global-sh.datarepo-dev.broadinstitute.org.",
        ]
      + ttl          = 300
      + type         = "CNAME"
    }

  # module.k8s-master.google_container_cluster.cluster will be updated in-place
  ~ resource "google_container_cluster" "cluster" {
        cluster_ipv4_cidr           = "10.48.0.0/14"
        default_max_pods_per_node   = 110
        enable_binary_authorization = false
        enable_intranode_visibility = false
        enable_kubernetes_alpha     = false
        enable_legacy_abac          = false
        enable_shielded_nodes       = false
        enable_tpu                  = false
        endpoint                    = "35.224.190.223"
        id                          = "projects/broad-jade-dev/locations/us-central1/clusters/dev-master"
        initial_node_count          = 1
        instance_group_urls         = [
            "https://www.googleapis.com/compute/beta/projects/broad-jade-dev/zones/us-central1-a/instanceGroups/gke-dev-master-dev-node-d3a1d314-grp",
            "https://www.googleapis.com/compute/beta/projects/broad-jade-dev/zones/us-central1-c/instanceGroups/gke-dev-master-dev-node-a5f5f478-grp",
            "https://www.googleapis.com/compute/beta/projects/broad-jade-dev/zones/us-central1-f/instanceGroups/gke-dev-master-dev-node-b471c5eb-grp",
        ]
        location                    = "us-central1"
        logging_service             = "logging.googleapis.com/kubernetes"
        master_version              = "1.15.9-gke.26"
      ~ min_master_version          = "1.15.9-gke.26" -> "1.15.11-gke.1"
        monitoring_service          = "monitoring.googleapis.com/kubernetes"
        name                        = "dev-master"
        network                     = "projects/broad-jade-dev/global/networks/dev-network"
        node_locations              = [
            "us-central1-a",
            "us-central1-c",
            "us-central1-f",
        ]
        node_version                = "1.15.9-gke.22"
        project                     = "broad-jade-dev"
        remove_default_node_pool    = true
        resource_labels             = {}
        services_ipv4_cidr          = "10.0.16.0/20"
        subnetwork                  = "projects/broad-jade-dev/regions/us-central1/subnetworks/dev-subnet"

        addons_config {

            network_policy_config {
                disabled = false
            }
        }

        cluster_autoscaling {
            enabled = false
        }

        database_encryption {
            state = "DECRYPTED"
        }

        ip_allocation_policy {
            cluster_ipv4_cidr_block       = "10.48.0.0/14"
            cluster_secondary_range_name  = "gke-dev-master-pods-7ae136da"
            create_subnetwork             = false
            services_ipv4_cidr_block      = "10.0.16.0/20"
            services_secondary_range_name = "gke-dev-master-services-7ae136da"
            use_ip_aliases                = false
        }

        master_auth {
            client_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMyekNDQWNPZ0F3SUJBZ0lSQUx3T0dBOUZORU0wem1UaWlQZE5BRGN3RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa1ptRmxOV1JpTVdNdE16RXhNUzAwT1RoaUxXSmhOamN0TjJZd1pXTXlPRGcyTVRNegpNQjRYRFRJd01ERXhNekU1TXpnME1sb1hEVEkxTURFeE1URTVNemcwTWxvd0VURVBNQTBHQTFVRUF4TUdZMnhwClpXNTBNSUlCSWpBTkJna3Foa2lHOXcwQkFRRUZBQU9DQVE4QU1JSUJDZ0tDQVFFQXFHbTJuOGNQTE0xSEE4QzYKV283RCtjanBlM2drRDBZSjJ6d21RUHdsbW5mdzU5dXUrYUxWd2YwcHlyTngyazlHSVBHSi8vMkdFWU1xaUJmLwpzamZQSDBzVG1DZVJHTkZLRHNZN3M1Y1JmK0UwbDBROFJmdDd5QzdSYlNKdXlYTFAwRkd3YTltcmRsRkFNSGJCCm1hVnowMUJxYkx2cVpXVGJvR25PN2JZN25XeDZKOFh1Zk1oM3lWZTI5Z1V5Rm5EU0xMRnNQUlNXT2JCRlNRWnAKcEtUbVBYUEJxWnpUOHMva0oxYzdJVzdkZ3dUcm1yaHBqZXFRVmxDNURiTmVFL2RjYmRvRHJKTUkxNTRYTTRwMgoxWW90RzdLa25ic3E3ZWdHL1Urek1YcEdFQ0c0ZE5tYy9LR0dsakswcVVqMUVQb3FOTENIcWgxY2VhcUFYRDNRCmtBZVVaUUlEQVFBQm94QXdEakFNQmdOVkhSTUJBZjhFQWpBQU1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQzEKUlh4ZVRCL2NaeWI4aXpDd0xNMTFKMFRDN3RxL3JFUFRIT1d2UnNOb2FpektnMVBiaVhER3E1VjNXTng4M2pySAp4OEtqWlpyT0UwU2lxeS9BVWNUYkgvdGNudXIzR1hpa1BmUDlrNzFRUUJPYmMvZzFRNTJNdm5FbHdWV2dFTHRNCkEwQ1M1cHRFVnRJb3NkVzhNMUFvRFNyY0NhSkVyRVlVbUlqRHBjUG9oVXlsb3pYclRpaFUxeExZZE9HKzhYTjcKK0RvbUJrQk5yUXIrYU9XQmREallIcVRUVlNMNEdsbFViNHN0ajB6Tm1iOHZESTJqQWphcExHNnAwWC9mSjBUbAp6ZlF0clBBRXVPMUZkUkNVU1BPcjN6UGI3WmxybG1aVG92TThNZ2hyQm1UMVU2RTRVbzd2RDBLMTN4UEd5Qmp5ClRRbjJnamMyRFJCZjZPcjM3U0JOCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            client_key             = (sensitive value)
            cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURERENDQWZTZ0F3SUJBZ0lSQUxLcWVpWWNnZ3dHNnFxL0RsRGpHTm93RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa1ptRmxOV1JpTVdNdE16RXhNUzAwT1RoaUxXSmhOamN0TjJZd1pXTXlPRGcyTVRNegpNQjRYRFRJd01ERXhNekU0TXpnME1Wb1hEVEkxTURFeE1URTVNemcwTVZvd0x6RXRNQ3NHQTFVRUF4TWtabUZsCk5XUmlNV010TXpFeE1TMDBPVGhpTFdKaE5qY3ROMll3WldNeU9EZzJNVE16TUlJQklqQU5CZ2txaGtpRzl3MEIKQVFFRkFBT0NBUThBTUlJQkNnS0NBUUVBM0VrbUhvbUxmL0UxTG43VERVeTNJUy9VVjNsTkk1aFV1Q0FHNjdicQorb0FnVlRGY2FVY0NmVld1WG9XS0k2a1NKRlFHdFlob2JGMUJuNjY2dXAvcFhBOUNBNkVqVGs0SDIyalcyMmxVCndBdTlGN21CMk16VnZLcVJycFEyVnpPeSs5emNVMnUyc3V2OEM1UTFScGhGTnpyVXJTaUErZSs5Qy90VGpqWTQKZFlhbGlSdjZvRjJVMWdrQ1hXWDFGUmRqL3ZzZHVxM2pEM1gvQy9XV1I4U0FNbzdSQU5vRzQyeXk4ZUh1N3dHOQovVFZja3RyMVFYZnpNeW5Tbko4d1o2N3loZWRIblp4cTU1dzhVbmNKaWhIZDJDUDI0SFdMTVFNNmZ4VERWT2loCnE1Q0pXd3BzOHRadXdGNWRFdFhsYVh6Q1hoWkk2enNRMkxlNm9kaFR3c045NFFJREFRQUJveU13SVRBT0JnTlYKSFE4QkFmOEVCQU1DQWdRd0R3WURWUjBUQVFIL0JBVXdBd0VCL3pBTkJna3Foa2lHOXcwQkFRc0ZBQU9DQVFFQQpUdTMxZFdaTkwwdHVyb3lvQXp4OTRRVDhyVzE3NWZrdC9zT1Jmalhkd0E5THVWYmxzN0tMNUJlQXhrL1RIWnFtCmJ2SzJJMHlXOHNXVXc1eVlGMFczTEIzZmtzYUo2SWp2dCt0ZC9sYlNJRFhNS2FyQ2ZpS1cyNHVRbWo3R1RyU2cKM3RJcU9DZ0U4K2gxc0ozaVJ4TkRkMyt5VWlWNmFQVVBiTEYzTXAraFRnQnpIYTYxTHVnZFJhY1FsMlVNN2xPQgorTFR1WWxjVHBhQTZ3OUE2OUd2b1ZQbDhmTFJuNm56UFp1MWxOelZWeldFMlg3VGNCMWdTUjA4djNtem1teUxzCnVicS9ZeXErb0kwOWxjV05VU2Nkdk0rQmJnYks2czMwNHluVEx6Nm5WaVNhM2NFN25NWmU2SG1oUW1qWitlekIKYXE1VnNGRjZsTlpza2NSNk0zNUVOUT09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"

            client_certificate_config {
                issue_client_certificate = true
            }
        }

        master_authorized_networks_config {
            cidr_blocks {
                cidr_block = "69.173.112.0/21"
            }
            cidr_blocks {
                cidr_block = "69.173.120.0/22"
            }
            cidr_blocks {
                cidr_block = "69.173.124.0/23"
            }
            cidr_blocks {
                cidr_block = "69.173.126.0/24"
            }
            cidr_blocks {
                cidr_block = "69.173.127.0/25"
            }
            cidr_blocks {
                cidr_block = "69.173.127.128/26"
            }
            cidr_blocks {
                cidr_block = "69.173.127.192/27"
            }
            cidr_blocks {
                cidr_block = "69.173.127.224/30"
            }
            cidr_blocks {
                cidr_block = "69.173.127.228/32"
            }
            cidr_blocks {
                cidr_block = "69.173.127.230/31"
            }
            cidr_blocks {
                cidr_block = "69.173.127.232/29"
            }
            cidr_blocks {
                cidr_block = "69.173.127.240/28"
            }
            cidr_blocks {
                cidr_block = "69.173.64.0/19"
            }
            cidr_blocks {
                cidr_block = "69.173.96.0/20"
            }
        }

        network_policy {
            enabled = true
        }

        node_config {
            disk_size_gb      = 50
            disk_type         = "pd-standard"
            guest_accelerator = []
            image_type        = "COS"
            labels            = {
                "environment" = "dev"
                "project"     = "jade"
            }
            local_ssd_count   = 0
            machine_type      = "n1-standard-2"
            metadata          = {
                "disable-legacy-endpoints"         = "true"
                "google-compute-enable-virtio-rng" = "false"
            }
            oauth_scopes      = [
                "https://www.googleapis.com/auth/compute",
                "https://www.googleapis.com/auth/devstorage.read_only",
                "https://www.googleapis.com/auth/logging.write",
                "https://www.googleapis.com/auth/monitoring",
            ]
            preemptible       = false
            service_account   = "default"
            tags              = [
                "jade",
                "dev",
                "kubernetes",
            ]
            taint             = []

            shielded_instance_config {
                enable_integrity_monitoring = true
                enable_secure_boot          = false
            }

            workload_metadata_config {
                node_metadata = "SECURE"
            }
        }

        node_pool {
            initial_node_count  = 3
            instance_group_urls = [
                "https://www.googleapis.com/compute/v1/projects/broad-jade-dev/zones/us-central1-a/instanceGroupManagers/gke-dev-master-dev-node-d3a1d314-grp",
                "https://www.googleapis.com/compute/v1/projects/broad-jade-dev/zones/us-central1-c/instanceGroupManagers/gke-dev-master-dev-node-a5f5f478-grp",
                "https://www.googleapis.com/compute/v1/projects/broad-jade-dev/zones/us-central1-f/instanceGroupManagers/gke-dev-master-dev-node-b471c5eb-grp",
            ]
            max_pods_per_node   = 110
            name                = "dev-node"
            node_count          = 1
            node_locations      = [
                "us-central1-a",
                "us-central1-c",
                "us-central1-f",
            ]
            version             = "1.15.9-gke.22"

            management {
                auto_repair  = true
                auto_upgrade = true
            }

            node_config {
                disk_size_gb      = 50
                disk_type         = "pd-standard"
                guest_accelerator = []
                image_type        = "COS"
                labels            = {
                    "environment" = "dev"
                    "project"     = "jade"
                }
                local_ssd_count   = 0
                machine_type      = "n1-standard-2"
                metadata          = {
                    "disable-legacy-endpoints"         = "true"
                    "google-compute-enable-virtio-rng" = "false"
                }
                oauth_scopes      = [
                    "https://www.googleapis.com/auth/compute",
                    "https://www.googleapis.com/auth/devstorage.read_only",
                    "https://www.googleapis.com/auth/logging.write",
                    "https://www.googleapis.com/auth/monitoring",
                ]
                preemptible       = false
                service_account   = "default"
                tags              = [
                    "jade",
                    "dev",
                    "kubernetes",
                ]
                taint             = []

                shielded_instance_config {
                    enable_integrity_monitoring = true
                    enable_secure_boot          = false
                }

                workload_metadata_config {
                    node_metadata = "SECURE"
                }
            }
        }

        pod_security_policy_config {
            enabled = true
        }

        private_cluster_config {
            enable_private_endpoint = false
            enable_private_nodes    = true
            master_ipv4_cidr_block  = "10.127.0.0/28"
            peering_name            = "gke-7ae136da26f1b146a914-c54d-8be5-peer"
            private_endpoint        = "10.127.0.2"
            public_endpoint         = "35.224.190.223"
        }

        release_channel {
            channel = "UNSPECIFIED"
        }
    }

Plan: 5 to add, 1 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions to validate/plan TF files`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
